/*目的
前期に学習したC++の内容を使って、簡単なカードゲームを作成してください。
この課題では、以下の内容を組み合わせてプログラムを作成します。
ゲームの概要

プレイヤーとCPUがカードを使って対戦します。

カードの合計点を21に近づけることが目的です。

ただし、合計が22以上になるとバーストとなり、そのプレイヤーの負けになります。

使用するカード

カードは全部で44枚使用します。値は1〜11として各4枚ずつ用意します。

カードのルール
カードの数字は1～11です。

同じ数字のカードが4枚ずつあります。

カードを引くたびに、残っているカードから1枚を選びます。

3．ゲーム開始
ゲーム開始時に、プレイヤーとCPUへそれぞれ2枚ずつカードを配ります。

例えば、

Player：7、5

合計：12


CPU：10、3

合計：13

のようになります。

4．プレイヤーのターン

最初にプレイヤーの合計点を確認します。

この時点で21の場合、CPUターンへ移ります。

プレイヤーは、

カードを引きますか？


0：Yes

1：No

を入力します。

「0：Yes」を選んだ場合
プレイヤーはカードを1枚引きます。

引いたカードの数字を合計に加えます。

例えば、

現在：12

引いたカード：6


12 + 6 = 18

となります。

カードを引いた後
合計点を確認します。

合計が21の場合
プレイヤーのターンを終了し、CPUのターンへ移ります。

合計が22以上の場合
バーストです。

Player：25


→ Playerの負け

となり、ゲーム終了です。

合計が20以下の場合
もう一度、

カードを引きますか？


0：Yes

1：No

とプレイヤーに確認します。

5.「1：No」を選んだ場合

プレイヤーはこれ以上カードを引きません。

プレイヤーのターンを終了し、CPUのターンへ移ります。

6．CPUのターン

CPUはプレイヤーとは違い、自分で「引く・引かない」を入力しません。

プログラムによって自動的に判断します。

CPUの合計点を確認し、以下のルールでカードを引きます。

CPUのカードを引くルール

① CPUの合計が15以下の場合
CPUは必ずカードを1枚引きます。

CPU：14


→ 15以下なのでカードを引く

カードを引いた後、もう一度CPUの合計を確認します。

② CPUの合計が16以上の場合
CPUの合計とプレイヤーの合計を比較します。

CPUの合計がプレイヤーより小さい場合は、CPUはカードを引きます。

Player：19

CPU：16


→ CPUの方が小さい

→ CPUはカードを引く

CPUがプレイヤーの合計以上になったら、カードを引くのをやめます。

Player：19

CPU：20


→ CPUの方が大きい

→ CPUはカードを引かない



7．CPUが21になった場合

CPUの合計が21になった場合、CPUはそれ以上カードを引きません。

その後、最終結果を判定します。

8．CPUが22以上になった場合
CPUが22以上になるとバーストです。

CPU：23


→ CPUの負け

→ Playerの勝ち

となります。

ゲーム終了です。

9．最終結果
プレイヤーとCPUの合計を比較します。

基本的には、21に近い方が勝ちです。

例1
Player：20

CPU：18


→ Playerの勝ち

例2
Player：17

CPU：20


→ CPUの勝ち

例3
Player：21

CPU：21


→ 引き分け

例4
Player：21

CPU：18


→ Playerの勝ち

課題で使用必須事項
・ポインタ
・クラス
・カプセル化*/
#include<iostream>
using namespace std;
int main()
{
	return 0;

}